#У вас есть список numbers. Напишите программу, которая заполняет список числами от 0 до 100 и выводит его на экран.
numbers = []
for _ in range(100):
	numbers.append(_)
print(numbers)